OdDAI.Entity.typeOf
\details
Retrieves a set of supertype names for the entity definition.
\returns A set of OdAnsiStrings which contain full names of supertypes (including schema name_ for the entity definition.

OdDAI.Entity.getPossibleRoles
\details
Collects all attributes of other entities that are references to the current one.
\returns An array of pointers to Attribute instances for the various entities definitions in the schema.

OdDAI.Entity.whereRulesFullCollection
\details
Collects all where rules of the type and all its supertypes.
\returns An array of pointers to WhereRule instances for the entity definition and all its supertypes.

OdDAI.Entity.findWhereRule(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
For entity definition and all its supertypes tries to recursively find WR Rule instance with name ruleName.
Stops searching on first occurrence of rule with name provided.
\param ruleName [in] An ANSI string that contains the name of the rule to find.
\returns A smart pointer to OdDAI::WhereRule.

OdDAI.Entity.rfindAttribute(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Searches for an attribute definition with a specified name for the entity definition and all its supertypes. The search proceeds in reversed order.
\param attrName [in] An ANSI string that contains the name of the attribute to find.
\returns A smart pointer to the found attribute definition; if the attribute is not found then a NULL smart pointer is returned.
\remarks
The search of an attribute is performed starting from this entity definition towards its supertypes.

OdDAI.Entity.findAttribute(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Searches for an attribute definition with a specified name for the entity definition and all its supertypes.
\param attrName [in] An ANSI string that contains the name of the attribute to find.
\returns A smart pointer to the found attribute definition; if the attribute is not found then a NULL smart pointer is returned.
\remarks
The search of the attribute is performed starting from the most base entity definition towards its subtypes
(to this entity definition).

OdDAI.Entity.explicitAttributes
\details
Collects all explicit attributes of the type and all its supertypes.
\returns An array of pointers to ExplicitAttribute instances for the entity definition and all its supertypes.

OdDAI.Entity.inverseAttributes
\details
Collects all inverse attributes of the type and all its supertypes.
\returns An array of pointers to InverseAttribute instances for the entity definition and all its supertypes.

OdDAI.Entity.referenceAttributes
\details
Collects all explicit attributes which are references or aggregations of
references for the type and all its supertypes.
\returns An array of pointers to ExplicitAttribute instances whose domain is other Entity for the entity definition and all its supertypes.

OdDAI.Entity.getAttr(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Retrieves the current value of an attribute specified by its name.
\param attrName [in] An ANSI string that contains the attribute name.
\returns The current value of the attribute represented with an OdRxValue object.
\remarks
The method provides the late binding access to the attribute value by its name.
Attributes of select and aggregate data types are also supported.

OdDAI.Entity.appendSuperType(OdDAI.Entity*)
\details
Appends a new supertype to the entity definition.
\param supertype [in] A raw pointer to an entity definition that defines the new supertype to be appended.

OdDAI.Entity.appendAttribute(OdSmartPtr&lt;OdDAI.Attribute&gt;)
\details
Appends a new attribute definition to the entity definition.
\param attributeDef [in] A smart pointer to an attribute definition to be added.

OdDAI.Entity.independent
\details
Retrieves whether the entity definition is independent or not.
\remarks
Non-independent definitions are visible by using REFERENCE keyword, or implicitly referenced.
\returns true if the entity definition is independent; otherwise, the method returns false.

OdDAI.Entity.complex
\details
Retrieves whether the entity definition is complex or not.
\returns true if the entity definition is complex; otherwise, the method returns false.

OdDAI.Entity.instantiable
\details
Retrieves whether the entity definition can be instantiated or not.
\returns true if the entity definition can be instantiated; otherwise, the method returns false.

OdDAI.Entity.isSupertypeOf(OdDAI.Entity!System.Runtime.CompilerServices.IsConst*)
\details
Check whether the entity is a supertype of another entity.
\param subtype [in] An entity subtype to check.
\returns true if the object is a supertype of the specified entity type; otherwise, the method returns false.

OdDAI.Entity.supertypes
\details
Retrieves the current list of the entity definition's supertypes.
\returns An STD list of the entity definition's supertypes.

OdDAI.Entity.attributes
\details
Retrieves the current list of attribute definitions for the entity definition.
\returns The array of attribute definitions.
\remarks
The attributes definitions of the superclass entity definition are not included in the resulting array.

OdDAI.Entity.createObject(OdDAI.Schema*,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*,System.Boolean,System.Boolean)
\details
Creates a new entity definition with a specified owning schema, name instantiable values.
\param owningSchema [in] Schema in which entity definition is declared.
\param entityName   [in] An entity definition name.
\param instantiable [in] A flag that defines whether the entity can be instantiated (equal to true) or not (equal to false).
\returns A smart pointer to the created entity.

OdDAI.Entity.#ctor(OdAnsiString,System.Boolean)
\details
Creates a new entity definition with specified parameters.
\param name         [in] A new entity definition name.
\param instantiable [in] A flag that defines whether the entity can be instantiated (equal to true) or not (equal to false).

OdDAI.Entity.#ctor
\details
Creates a new entity definition with default parameters.

OdDAI.Entity
\details
A class that provides an entity definition within a schema.